{"pageProps":{"source":{"compiledSource":"var d=Object.defineProperty,m=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(a,n,o)=>n in a?d(a,n,{enumerable:!0,configurable:!0,writable:!0,value:o}):a[n]=o,e=(a,n)=>{for(var o in n||(n={}))r.call(n,o)&&l(a,o,n[o]);if(i)for(var o of i(n))s.call(n,o)&&l(a,o,n[o]);return a},h=(a,n)=>m(a,u(n));var p=(a,n)=>{var o={};for(var t in a)r.call(a,t)&&n.indexOf(t)<0&&(o[t]=a[t]);if(a!=null&&i)for(var t of i(a))n.indexOf(t)<0&&s.call(a,t)&&(o[t]=a[t]);return o};const makeShortcode=a=>function(o){return console.warn(\"Component \"+a+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",e({},o))},Image=makeShortcode(\"Image\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var t=o,{components:a}=t,n=p(t,[\"components\"]);return mdx(MDXLayout,h(e(e({},layoutProps),n),{components:a,mdxType:\"MDXLayout\"}),mdx(\"p\",null,\"This article is for software engineers alike looking to progress in their careers and wonder what their path should be beyond a Senior level. I will share my thoughts on the topic and what I've learned.\"),mdx(\"h2\",e({},{id:\"tldr\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#tldr\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"TL;DR\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"It is prevalent to perceive potential growth beyond senior as a management career path.\"),mdx(\"li\",{parentName:\"ul\"},\"There is an alternative career path called Staff engineer.\"),mdx(\"li\",{parentName:\"ul\"},\"Staff engineer is a senior role that is not a management role.\"),mdx(\"li\",{parentName:\"ul\"},\"You need to find what works for you the best.\"),mdx(\"li\",{parentName:\"ul\"},\"A tool called Ikigai can be of help.\"),mdx(\"li\",{parentName:\"ul\"},\"Read books, find a mentor, and talk with your manager.\")),mdx(\"h2\",e({},{id:\"we-all-want-to-grow\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#we-all-want-to-grow\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"We all want to grow\"),mdx(\"p\",null,\"As I've been working for more years, I got promoted first to mid-level and then to Senior engineer. After I worked in the senior role more, I felt the urge to progress further. \"),mdx(\"p\",null,\"Everyone is looking to get recognition for our work and our continuous effort. More knowledgeable people also usually bring more value to the company: they have a high-level understanding, domain-specific knowledge, and communication skills. So we are looking to get promoted over time. \"),mdx(\"p\",null,\"And the only way to progress that was available, or at least that I've seen, was to become an engineering manager. There are multiple reasons for that. For one, the company where I worked was relatively small. There was always room for a new EM since only three to five people were needed to form a team. Secondly, I've seen many people who were in the senior role for a long time and became managers. So this was percieved by me as the only way to progress.\"),mdx(\"p\",null,\"As my career in engineering management progressed, I started perceiving a problem. I've seen many people who were great engineers, but they were not great managers. They were not happy with their new role, and they were not happy with their new responsibilities, new career path they were forced to take.\"),mdx(\"h2\",e({},{id:\"staff-engineer\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#staff-engineer\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Staff engineer\"),mdx(\"p\",null,\"Over time I learned there is an alternative careeer path that is not so well known. It is called Staff engineer.\"),mdx(\"p\",null,\"The more we work on something, the better we get. \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.bbc.com/news/magazine-26384712\"}),\"Some people\"),\" claim one needs to invest 10.000 hours into something to become an expert. Some say, 1.000 hours would be sufficient. However, no one would argue that the more you work on something, the deeper your knowledge becomes.\"),mdx(Image,{alt:\"Funnel\",src:\"/images/beyond_senior/funnel.png\",width:945,height:530,layout:\"fixed\",priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"Out of the people working in a specific area, some would switch to a different one over time. Out of 10 backend engineers starting fresh out of college, probably six continue working in this area for the next three years. Two would switch to DevOps, one would switch to frontend, and one would change to management. I am showing a simplified, average case. If you take a more extended period, the chances that people would switch to a different area will increase. This creates a funnel. It is always harder to find people with more experience in a specific area if you look for someone more experienced.\"),mdx(\"p\",null,\"Only some people with a lot of experience are great engineers. But with the right mindset, a person with much experience can unblock a big team and lead without formal leadership.\"),mdx(\"p\",null,`For bigger companies, it makes sense to employ experienced engineers that would enhance the team's knowledge and help unblock the team. This role has different names, but it is mostly called Staff Engineer or Principal Engineer. Term Staff engineer was coming from the old times of engineering when engineers were responsible for constructing material things: a \"staff\" traditionally referred to a rod or pole used to take measurements during surveying. The term \"staff engineer\" originally referred to a senior engineer responsible for managing a team of engineers and surveyors. `,mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.quora.com/What-is-the-etymology-of-the-title-Staff-Engineer#:~:text=In%20civil%20engineering%2C%20a%20%22staff,and%20surveyors%20in%20the%20field.\"}),\"1\")),mdx(\"p\",null,\"There are many different definitions of what a Staff engineer is. Some examples of what Staff Engineer does would be \"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Technical leadership, mentorship, and guidance to development teams.\"),mdx(\"li\",{parentName:\"ul\"},\"Driving innovation and continuous improvement in software development processes.\"),mdx(\"li\",{parentName:\"ul\"},\"Architectural design and system scaling for complex systems.\"),mdx(\"li\",{parentName:\"ul\"},\"Research and development of new technologies and frameworks.\"),mdx(\"li\",{parentName:\"ul\"},\"Performance optimization to enhance software efficiency.\"),mdx(\"li\",{parentName:\"ul\"},\"Contributing to the company's technical strategy and roadmap.\"),mdx(\"li\",{parentName:\"ul\"},\"Facilitating cross-team collaboration and knowledge sharing.\"),mdx(\"li\",{parentName:\"ul\"},\"Code and system reviews to ensure quality and security.\")),mdx(\"h3\",e({},{id:\"ikigai\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#ikigai\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Ikigai\"),mdx(Image,{alt:\"Ikigai\",src:\"/images/beyond_senior/ikigai.png\",width:365,height:365,layout:\"fixed\",priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,`Ikigai is a Japanese concept that means \"a reason for being.\" The word refers to having a direction or purpose in life that makes one's life worthwhile and towards which an individual takes spontaneous and willing actions, giving them satisfaction and a sense of meaning to life. `,mdx(\"a\",e({parentName:\"p\"},{href:\"https://en.wikipedia.org/wiki/Ikigai\"}),\"2\")),mdx(\"p\",null,\"So why do we go into the philosophy here? It is essential to understand what drives you. What is your purpose? What is your goal? What do you want to achieve? It is much easier to work on things you enjoy doing.\"),mdx(\"p\",null,\"In its essence, Ikigai is a combination of 4 things:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"What you love\"),mdx(\"li\",{parentName:\"ul\"},\"What you are good at\"),mdx(\"li\",{parentName:\"ul\"},\"What the world needs\"),mdx(\"li\",{parentName:\"ul\"},\"What you can be paid for\")),mdx(\"p\",null,\"If you find something that combines all 4, you are in a great position. This could be engineering management, but it could also be a staff engineer role. Trying out different roles would give you a unique perspective and help you find your Ikigai.\"),mdx(\"h3\",e({},{id:\"the-pendulum\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#the-pendulum\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"The pendulum\"),mdx(\"p\",null,\"It is fair to assume that it is hard to predict if you will be good at something before you try it. It could be that a management career is right for you. But it could also be that you would not like it.\"),mdx(\"p\",null,\"The ideal situation would be for you to find an opportunity to try one of your career paths. Mentorship and guidance from a colleague already in this role would greatly help. \"),mdx(\"p\",null,\"It is OK to try something and then decide it is not for you. \"),mdx(\"p\",null,\"Many engineering managers come from an engineering background. It can be a good idea to have a pendulum approach, where you switch from time to time between both paths. This could give you unique insight as an engineering manager on the technical aspect of the project, and vice versa, and would allow you to understand the management side of the project as an engineer.\"),mdx(\"h3\",e({},{id:\"practical-thoughts\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#practical-thoughts\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Practical thoughts\"),mdx(\"p\",null,\"Your physical location can restrict the career path of a Staff engineer. As I mentioned above, more companies have a smaller engineering department (take startups, agencies, etc.) than the big ones. In a small team, there is frequently no room to promote an individual contributor above the senior level.\"),mdx(\"p\",null,\"If in the area where you live, there are no bigger companies; you can try to find a remote job. However, it is only sometimes possible. \"),mdx(\"p\",null,\"Considering this, you might have to move to advance in this career path. This is only sometimes possible, especially if you have a family.\"),mdx(\"h2\",e({},{id:\"conclusion\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#conclusion\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Conclusion\"),mdx(\"p\",null,\"It is only a small blog post; I recommend watching talks on the topic and reading books to better look at the potential you can unleash in progressing your career. \"),mdx(\"p\",null,\"I can recommend the following books:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"An Elegant Puzzle by Will Larson\"),mdx(\"li\",{parentName:\"ul\"},\"The Manager's Path by Camille Fournier\"),mdx(\"li\",{parentName:\"ul\"},\"Staff Engineer: Leadership beyond the management track by Will Larson\"),mdx(\"li\",{parentName:\"ul\"},\"The Staff Engineer's Path: A Guide For Individual Contributors Navigating Growth and Change by Tanya Reilly\")),mdx(\"p\",null,\"Finding a mentor in your organization or outside of it would also be a great help, as they could support you on your journey.\"),mdx(\"p\",null,\"Make sure to talk with your manager to discuss your career opportunities. There might be an opportunity waiting for you that you are not aware of.\"),mdx(\"p\",null,\"Your career is in your hands, and you can shape it however you want. Don't be afraid to try something new, and don't be scared to fail.\"))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"Your career beyond senior","description":"Your career beyond senior","date":"2023-05-17","image":"/images/cache-spm/cover.jpg","published":false}},"frontMatter":{"title":"Your career beyond senior","description":"Your career beyond senior","date":"2023-05-17","image":"/images/cache-spm/cover.jpg","published":false}},"__N_SSG":true}