{"pageProps":{"source":{"compiledSource":"var m=Object.defineProperty,d=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(a,n,t)=>n in a?m(a,n,{enumerable:!0,configurable:!0,writable:!0,value:t}):a[n]=t,e=(a,n)=>{for(var t in n||(n={}))r.call(n,t)&&l(a,t,n[t]);if(i)for(var t of i(n))s.call(n,t)&&l(a,t,n[t]);return a},h=(a,n)=>d(a,u(n));var p=(a,n)=>{var t={};for(var o in a)r.call(a,o)&&n.indexOf(o)<0&&(t[o]=a[o]);if(a!=null&&i)for(var o of i(a))n.indexOf(o)<0&&s.call(a,o)&&(t[o]=a[o]);return t};const makeShortcode=a=>function(t){return console.warn(\"Component \"+a+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",e({},t))},Image=makeShortcode(\"Image\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var o=t,{components:a}=o,n=p(o,[\"components\"]);return mdx(MDXLayout,h(e(e({},layoutProps),n),{components:a,mdxType:\"MDXLayout\"}),mdx(Image,{alt:\"Career path\",src:\"/images/beyond_senior/cover.webp\",width:640,height:426,layout:\"fixed\",priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"This article is for software engineers alike who are looking to progress in their careers and wonder what their path should be beyond a Senior level. In this article, I will share my thoughts on this topic based on my own experiences and what I've learned.\"),mdx(\"h2\",e({},{id:\"tldr\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#tldr\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"TL;DR\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"It is common to associate potential growth with a management career path.\"),mdx(\"li\",{parentName:\"ul\"},\"There is an alternative career path known as Staff Engineer.\"),mdx(\"li\",{parentName:\"ul\"},\"Staff Engineer is a senior role that does not involve management responsibilities.\"),mdx(\"li\",{parentName:\"ul\"},\"You need to find what works for you best.\"),mdx(\"li\",{parentName:\"ul\"},\"The Ikigai Framework can be a useful tool.\"),mdx(\"li\",{parentName:\"ul\"},\"Read books, find a mentor, and talk with your manager.\")),mdx(\"h2\",e({},{id:\"we-all-want-to-grow\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#we-all-want-to-grow\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"We all want to grow\"),mdx(\"p\",null,\"As I've been working for more years, I got promoted first to mid-level and then to Senior Engineer. The more I worked in the senior role, the stronger I felt the urge to progress further. \"),mdx(\"p\",null,\"Recognition for our work for our continuous efforts is something we all seek. More knowledgeable people also usually bring more value to the company: they have a high-level understanding, domain-specific knowledge, and communication skills. So we are looking to get promoted over time. \"),mdx(\"p\",null,\"And the only way to progress that was available, or at least the one I've seen, was to become an engineering manager. There are multiple reasons for that: \"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Firstly, the company where I worked was relatively small, so there was always room for a new EM since only three to five people were needed to form a team. \"),mdx(\"li\",{parentName:\"ul\"},\"Secondly, I've seen many people who were in senior roles for a long time eventually become managers. So this path seemed like the only way to progress.\")),mdx(\"p\",null,\"As my career in engineering management progressed, I notice a problem. I've seen many people who were great engineers, but they were not great managers. They were not happy with their new roles,  new responsibilities, and the new career path they were forced to take.\"),mdx(\"h2\",e({},{id:\"staff-engineer\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#staff-engineer\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Staff Engineer\"),mdx(\"p\",null,\"Over time, I learned there is an alternative career path that is not so well known: \",mdx(\"em\",{parentName:\"p\"},\"Staff Engineer\"),\".\"),mdx(\"p\",null,\"The more we work on something, the better we get. \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.bbc.com/news/magazine-26384712\"}),\"Some people\"),\" suggest one needs to invest 10.000 hours into something to become an expert, while others say that, 1.000 hours would be sufficient. However, no one would argue that the more you work on something, the deeper your knowledge becomes.\"),mdx(Image,{alt:\"Funnel of a career path\",src:\"/images/beyond_senior/funnel.png\",width:640,height:364,layout:\"fixed\",priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"Within a specific area, it is common for people to transition to different roles over time. For instance, out of 10 backend engineers starting their careers fresh out of college, probably around six would continue working in that area for the next three years. Two might switch to DevOps, one might switch to frontend, and one may transition to a management role. I am showing a simplified, average case. If you take an extended time period, the likelihood of people switching to a different area increases, creating a funnel effect. As a result, it always gets harder to find people with more experience in a specific area.\"),mdx(\"p\",null,`As companies look for more experienced engineers, finding suitable ones gets harder. This is why experienced engineers are often rewarded with higher compensation. In general, the compensation for staff roles is comparable to management roles, so you don't have to worry about this aspect.\nOnly some people with extensive experience are great engineers. But with the right mindset, an experienced person can unblock a big team and lead without formal leadership.`),mdx(\"p\",null,\"For bigger companies, it makes sense to employ experienced engineers who can enhance the team's knowledge and help unblock the team. This role has different names, but it is often called \",mdx(\"em\",{parentName:\"p\"},\"\\u201CStaff Engineer\\u201D\"),\" or \",mdx(\"em\",{parentName:\"p\"},\"\\u201CPrincipal Engineer\\u201D\"),\". The term \",mdx(\"em\",{parentName:\"p\"},\"\\u201CStaff Engineer\\u201D\"),' comes from the old times of engineering when engineers were responsible for constructing material things: a \"staff\" traditionally referred to a rod or pole used to take measurements during surveying. The term \"Staff Engineer\" originally referred to a senior engineer responsible for managing a team of engineers and surveyors. ',mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.quora.com/What-is-the-etymology-of-the-title-Staff-Engineer#:~:text=In%20civil%20engineering%2C%20a%20%22staff,and%20surveyors%20in%20the%20field.\"}),\"1\")),mdx(\"h3\",e({},{id:\"what-staff-engineer-does\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#what-staff-engineer-does\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"What Staff engineer does\"),mdx(\"p\",null,\"There are many different definitions of what a Staff Engineer is. Some examples include:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Technical leadership, mentorship, and guidance to development teams.\"),mdx(\"li\",{parentName:\"ul\"},\"Driving innovation and continuous improvement in software development processes.\"),mdx(\"li\",{parentName:\"ul\"},\"Architectural design and system scaling for complex systems.\"),mdx(\"li\",{parentName:\"ul\"},\"Research and development of new technologies and frameworks.\"),mdx(\"li\",{parentName:\"ul\"},\"Performance optimization to enhance software efficiency.\"),mdx(\"li\",{parentName:\"ul\"},\"Contributing to the company's technical strategy and roadmap.\"),mdx(\"li\",{parentName:\"ul\"},\"Facilitating cross-team collaboration and knowledge sharing.\"),mdx(\"li\",{parentName:\"ul\"},\"Code and system reviews to ensure quality and security.\")),mdx(\"h3\",e({},{id:\"ikigai\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#ikigai\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Ikigai\"),mdx(Image,{alt:\"Ikigai\",src:\"/images/beyond_senior/ikigai.png\",width:365,height:365,layout:\"fixed\",priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,`Ikigai is a Japanese concept meaning \"a reason for being.\" The word refers to having a direction or purpose in life that makes one's life worthwhile and towards which an individual takes spontaneous and willing actions, giving them satisfaction and a sense of meaning to life. `,mdx(\"a\",e({parentName:\"p\"},{href:\"https://en.wikipedia.org/wiki/Ikigai\"}),\"2\")),mdx(\"p\",null,\"So why do we go into the philosophy here? \"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"It is essential to understand what drives you. \"),mdx(\"li\",{parentName:\"ul\"},\"What is your purpose? \"),mdx(\"li\",{parentName:\"ul\"},\"What is your goal? \"),mdx(\"li\",{parentName:\"ul\"},\"What do you want to achieve? It is much easier to work on things you enjoy doing.\")),mdx(\"p\",null,\"In its essence, Ikigai is a combination of 4 things: what you love, what you are good at, what the world needs, and what you can be paid for.\"),mdx(\"p\",null,\"If you find something that combines all four aspects, you are in a great position. This could be engineering management, but it could also be a staff engineer role. Trying out different roles would give you a unique perspective and help you find your Ikigai.\"),mdx(\"h3\",e({},{id:\"the-pendulum\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#the-pendulum\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"The pendulum\"),mdx(\"p\",null,\"It is fair to assume that it is hard to predict if you will be good at something before you try it. It could be that a management career is right for you. But it could also be that you would not like it.\"),mdx(\"p\",null,\"The ideal situation would be for you to find an opportunity to try one of your career paths. Having mentorship and guidance from a colleague already in this role would greatly help. \"),mdx(\"p\",null,\"It is OK to try something and then decide it is not for you. \"),mdx(\"p\",null,\"Many engineering managers come from an engineering background. It can be a good idea to have a pendulum approach, where you switch between both paths time to time. This could give you a unique insight as an Engineering Manager on the technical aspect of the project, and vice versa, and would allow you to understand the management side of the project as an engineer.\"),mdx(\"h3\",e({},{id:\"practical-thoughts\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#practical-thoughts\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Practical thoughts\"),mdx(\"p\",null,\"Your physical location can restrict the career path of a Staff Engineer. As I mentioned above, many companies e.g. startups, agencies, etc. have smaller engineering teams compared to large companies. In a small team, there is frequently no room to promote an individual contributor above the senior level.\"),mdx(\"p\",null,\"If there are no bigger companies in the area where you live, you can try to find a remote job. However, it is only sometimes possible. Considering this, you might have to move abroad to advance in this career path. This is only sometimes possible, especially if you have a family.\"),mdx(\"h2\",e({},{id:\"conclusion\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#conclusion\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Conclusion\"),mdx(\"p\",null,\"This is only a small blog post -- I recommend watching talks on this topic and reading books to better look at the potential you can unleash in progressing your career. \"),mdx(\"p\",null,\"I can recommend the following books:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"An Elegant Puzzle by Will Larson\"),mdx(\"li\",{parentName:\"ul\"},\"The Manager's Path by Camille Fournier\"),mdx(\"li\",{parentName:\"ul\"},\"Staff Engineer: Leadership beyond the management track by Will Larson\"),mdx(\"li\",{parentName:\"ul\"},\"The Staff Engineer's Path: A Guide For Individual Contributors Navigating Growth and Change by Tanya Reilly\")),mdx(\"p\",null,\"Finding a mentor within or outside your organization would also be a great help as they could support you on your journey. Make sure to talk with your manager to discuss your career opportunities. There might be an opportunity waiting for you that you are not aware of.\"),mdx(\"p\",null,\"Your career is in your hands, and you can shape it however you want. Don't be afraid to try something new, and don't be scared to fail.\"))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"Your career beyond senior","description":"For software engineers alike who are looking to progress in their careers and wonder what their path should be beyond a Senior level.","date":"2023-05-17","image":"/images/beyond_senior/cover.webp","published":true}},"frontMatter":{"title":"Your career beyond senior","description":"For software engineers alike who are looking to progress in their careers and wonder what their path should be beyond a Senior level.","date":"2023-05-17","image":"/images/beyond_senior/cover.webp","published":true}},"__N_SSG":true}