{"pageProps":{"source":{"compiledSource":"var d=Object.defineProperty,c=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var o=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var p=(a,t,n)=>t in a?d(a,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):a[t]=n,e=(a,t)=>{for(var n in t||(t={}))s.call(t,n)&&p(a,n,t[n]);if(o)for(var n of o(t))r.call(t,n)&&p(a,n,t[n]);return a},l=(a,t)=>c(a,m(t));var h=(a,t)=>{var n={};for(var i in a)s.call(a,i)&&t.indexOf(i)<0&&(n[i]=a[i]);if(a!=null&&o)for(var i of o(a))t.indexOf(i)<0&&r.call(a,i)&&(n[i]=a[i]);return n};const makeShortcode=a=>function(n){return console.warn(\"Component \"+a+\" was not imported, exported, or provided by MDXProvider as global scope\"),mdx(\"div\",e({},n))},Image=makeShortcode(\"Image\"),layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var i=n,{components:a}=i,t=h(i,[\"components\"]);return mdx(MDXLayout,l(e(e({},layoutProps),t),{components:a,mdxType:\"MDXLayout\"}),mdx(Image,{alt:\"Steve Jobs Theater\",src:\"/images/wwdc25/sj_theater.jpg\",width:1913,height:1014,priority:!0,mdxType:\"Image\"}),mdx(\"h2\",e({},{id:\"what-is-wwdc-special-event\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#what-is-wwdc-special-event\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"What is WWDC special event\"),mdx(\"p\",null,\"This year I've had an opportunity to visit Apple's WWDC'25 Special Event and other activities connected to the WWDC'25 conference.\"),mdx(\"p\",null,\"Most of the conference and content remain accessible online, as during the COVID pandemic Apple moved the conference in the online format. However, since 2022 there have been special activities for everyone interested in the latest Apple technology.\"),mdx(\"p\",null,\"Attendance at the special event is free, so one can consider applying, having a valid way to travel to the US, and ability to finance the trip. In most companies, this would fall into an educational budget.\"),mdx(\"p\",null,\"But why travel, if most of the conference materials are available online? The reason is two-fold, first getting a chance to see Apple Headquarters is an opportunity that does not happen every day. Even if traveling to Cupertino, the Apple Park building is not visible from the nearby streets. The building is definitely a highlight, as well as all the campus areas. If you are also a fan of Apple technology, or at least it is taking a big part in your professional life, going to visit the mothership is a great opportunity to connect to its source.\"),mdx(\"p\",null,\"The second reason is to have a chance to connect with numerous engineers and designers from worldwide, as well as to be able to ask direct questions to Apple engineers in the in-person labs. I've had a chance to meet Ben Cohen (manager in the Swift team), Chris Eidhof (from objc.io) Paul Hudson (creator of Hacking with Swift), and many other people who are defining the direction of the technology, work at Apple on it's implementation and share the knowledge in the community. Their insights are invaluable, allowing us to make better decisions now to make sure the work we are doing is set up for success going forward.\"),mdx(\"h3\",e({},{id:\"how-the-events-around-wwdc-are-happening-and-how-to-get-there\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#how-the-events-around-wwdc-are-happening-and-how-to-get-there\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"How the events around WWDC are happening, and how to get there\"),mdx(Image,{alt:\"Apple Park\",src:\"/images/wwdc25/apple_park.jpg\",width:2e3,height:1500,priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"Once a year Apple is calling in for all Developers on the Apple platforms to share the latest software news on all their platforms. Those include iOS, watchOS, tvOS, macOS, iPadOS and visionOS as well as the updates on Xcode, Swift, and other developer tools and frameworks.\"),mdx(\"p\",null,\"I've had a chance to visit the first in-person WWDC after COVID in 2022 and it was a blast! There are two ways to attend: either as an Apple Student Challenge or as a registered Apple Developer. As a developer, in order to get there, it is necessary to indicate your willingness to attend. Out of all people interested they select randomly around 1200-1500 engineers to attend an in-person event.\"),mdx(\"p\",null,\"I am really grateful to Delivery Hero and my managers to support my intention of visiting the conference on the company's behalf, as well as to Apple for organizing the in-person event.\"),mdx(\"h4\",e({},{id:\"in-person-event\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#in-person-event\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"In-person event\"),mdx(Image,{alt:\"Special Event Stage\",src:\"/images/wwdc25/stage.jpg\",width:2e3,height:1147,priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"The in-person event happens on-site in Apple's Headquarters: Apple Park simultaneously with the WWDC online. Once a developer receives a badge, they are invited to enter Apple Park and watch the Keynote and the Platforms State of the Unity presentations (in recording), as well as the Apple Design Award live.\"),mdx(\"h4\",e({},{id:\"labs\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#labs\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Labs\"),mdx(\"p\",null,\"In the second part of the day, the labs are taking place.\"),mdx(\"p\",null,\"Labs is the place where engineers are invited to talk to Apple employees on the topics they need support with or need a question answered. The questions might be connected to pretty much anything Apple employees could answer: AppStore rules, tricky issues connected to system frameworks, new technology released, you name it.\"),mdx(\"h4\",e({},{id:\"developer-activities\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#developer-activities\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Developer Activities\"),mdx(\"p\",null,\"This year Apple created another delight for WWDC guests, which is called Developer Activities. It's an additional event on the second conference day. This year they were connected to the Liquid Glass interface. Guests were invited to an in-person presentation in the Big Sur auditorium in the Developer Center (next to Apple Park). Then Apple designers and developers did a presentation on the design ideas behind the Liquid Glass and some technical aspects of its implementation.\"),mdx(\"p\",null,\"I think this was way more engaging than watching an online video. Additionally, after the presentation, it was possible to chat with the presenters and other Apple employees, which was quite similar to the labs on the first day. \"),mdx(\"h4\",e({},{id:\"f1-movie-screening\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#f1-movie-screening\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"F1 Movie Screening\"),mdx(Image,{alt:\"Steve Jobs Theater entrance\",src:\"/images/wwdc25/sj_theater_entrance.jpg\",width:702,height:1e3,priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"An additional nice touch from Apple this year was to invite the developers for the pre-screening of the F1 movie in the Steve Jobs Theater. This is where all the iPhones are announced to the press, located on the Apple Park site. It's an incredible structure, with a lobby on the ground with glass walls and an underground cinema/theater. I am really thankful to whoever suggested inviting developers there.\"),mdx(\"h2\",e({},{id:\"whats-new\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#whats-new\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"What's new\"),mdx(\"p\",null,\"I think in general the news from WWDC was shared by many news and blogs, so I would go in detail only with the specifics relevant to iOS development. I think one of the great sources of information is \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://developer.apple.com/documentation/xcode-release-notes/xcode-26-release-notes\"}),\"Xcode 26 release notes\"),\". They summarize all the new APIs available. In comparison to the WWDC videos, those might miss some of the context, but if you find a new and exciting API you can always watch a corresponding video. \"),mdx(\"p\",null,\"Here are some of my highlight posts that I recommend to check out to get up to speed\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://tuist.dev/blog/2025/06/10/wwdc\"}),\"Developer experience wins from WWDC25 by Pedro Pi\\xF1era\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://www.donnywals.com/exploring-concurrency-changes-in-swift-6-2/\"}),\"Exploring concurrency changes in Swift 6.2 by Donny Wals\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://www.donnywals.com/setting-default-actor-isolation-in-xcode-26/\"}),\"Setting default actor isolation in Xcode 26 by Donny Wals\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://www.hackingwithswift.com/articles/278/whats-new-in-swiftui-for-ios-26\"}),\"What's new in SwiftUI for iOS 26 by Paul Hudson\"))),mdx(\"p\",null,\"And here's the collection of my favorite talks from the conference:\"),mdx(\"p\",null,\"Must watch\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/245/\"}),\"What\\u2019s new in Swift\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/243/\"}),\"What\\u2019s new in UIKit\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/268/\"}),\"Embracing Swift concurrency\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/312/\"}),\"Improve memory usage and performance with Swift\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/308/\"}),\"Optimize CPU performance with Instruments\"))),mdx(\"p\",null,\"Should watch\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/256/\"}),\"What\\u2019s new in SwiftUI\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/306/\"}),\"Optimize SwiftUI performance with Instruments\"))),mdx(\"p\",null,\"For me personally, the three specific topics stand out: Liquid Glass, Xcode AI tools and Foundation Models.\"),mdx(\"h3\",e({},{id:\"liquid-glass-and-its-impact\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#liquid-glass-and-its-impact\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Liquid Glass and its impact\"),mdx(Image,{alt:\"Liquid Glass UI\",src:\"/images/wwdc25/liquid_glass.jpg\",width:2e3,height:1152,priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"I've been delighted by the new UI language from Apple. The last time the big UI change happened was in 2013 when we went from a skeuomorphic user interface, mimicking physical objects and surfaces to an abstract one. I think they say that mode makes comebacks, so here we are with the user interface mimicking physical objects (liquid glass) again. \"),mdx(\"p\",null,\"I really love how playful and \",mdx(\"em\",{parentName:\"p\"},\"fluid\"),\" the interface interaction is in iOS 26. It's possible thanks to Metal and shaders, as well as Apple's hardware and software unity. It would definitely take time to adapt to this one.\"),mdx(\"p\",null,\"If you are like me fascinated with this new UI, consider watching \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/219/\"}),\"Meet Liquid Glass\"),\" session, or multiple others Apple provided this year.\"),mdx(\"h3\",e({},{id:\"xcode-ai-tools-integration\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#xcode-ai-tools-integration\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Xcode AI tools integration\"),mdx(Image,{alt:\"F1 car from the movie\",src:\"/images/wwdc25/f1.jpg\",width:2e3,height:1052,priority:!0,mdxType:\"Image\"}),mdx(\"p\",null,\"Apple is going ahead with embracing the AI elements in its software, making engineers using Xcode benefit from the variety of AI tools. I can't wait to give it a try in production. One thing to keep in mind is, if the Xcode would be developed in a lifecycle faster than one year per release, wouldn't it be possible for Apple developers to publish this new, but arguably trivial to implement an addition to Xcode faster? As I am sure, in the year to come until we see Xcode 27 there will be many more different AI tools that might not fit what Xcode 26 would bring us. \"),mdx(\"p\",null,\"If you are looking for more info, check out this session: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/247/\"}),\"What\\u2019s new in Xcode 26\"),\".\"),mdx(\"h3\",e({},{id:\"foundation-models\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#foundation-models\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Foundation Models\"),mdx(\"p\",null,\"This year Apple is shipping a new framework called Foundation Models for the app developers. It's essentially a state-of-the art LLM model running on the device using device's silicon performance. Those models are installed with the operating system, so there is no need to include them in the app's bundle.\"),mdx(\"p\",null,\"I think this opens up a lot of interesting possibilities for the apps, for example for generating reply suggestions in the chat. What can be added to your app based on this framework?\"),mdx(\"p\",null,\"Apple published several sessions on the Foundation Models, I enjoyed this one the most: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://developer.apple.com/videos/play/wwdc2025/301/\"}),\"Deep dive into the Foundation Models framework\"),\".\"),mdx(\"h2\",e({},{id:\"conclusion\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#conclusion\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Conclusion\"),mdx(\"p\",null,\"I love Apple innovations that unlock many new possibilities for developers on Apple platforms. I am looking forward to the new releases of Apple beta software.\"),mdx(\"sub\",null,\"This article is written using natural intelligence, corrected with Grammarly.\"))}MDXContent.isMDXComponent=!0;\n","scope":{"title":"WWDC'25 Special Event","description":"Impressions from visiting Apple's WWDC'2025 special event, part of the WWDC'25 conference.","date":"2025-06-24","image":"/images/wwdc25/sj_theater.jpg","published":false}},"frontMatter":{"title":"WWDC'25 Special Event","description":"Impressions from visiting Apple's WWDC'2025 special event, part of the WWDC'25 conference.","date":"2025-06-24","image":"/images/wwdc25/sj_theater.jpg","published":false}},"__N_SSG":true}